import React from "react";
import { Card } from "react-daisyui";

function DisplayRuleFinal() {


return (
 <div className="flex flex-col items-center justify-center min-h-screen text-gray-700 p-2 gap-5">
    <div  className="p-0 rounded-lg text-white shadow-2xl text-center text-5xl opacity-70 animate__animated animate__fadeIn" style={{ animationDelay: "500ms" }}>
        <strong><p className="text-md">กติกาการแข่ง Final</p></strong>
    </div>
    <div className="bg-white ml-10 mr-10 p-10 rounded-lg animate__animated animate__fadeIn" style={{ animationDelay: "1000ms",fontSize: '1rem'}}>
    <ul>
        <li>1 การตอบคำถามในรอบชนะเลิศ เป็นการพิมพ์คำตอบอัตนัยแบบสั้น หรือ short answer ลงในแท็ปเล็ตภายในระยะเวลาที่กำหนด และต้องกดปุ่ม SAVE เพื่อบันทึกคำตอบอีกครั้ง ซึ่งจะเริ่มพิมพ์ได้หลังจากพิธีกรอ่านคำถาม
        </li>
            <br />
        <li>2 ผู้เข้าแข่งขันสามารถจดบันทึกหรือทดลงบนไวท์บอร์ดที่จัดเตรียมไว้ได้
        </li>
            <br />
        <li>3. หากข้อใดมีคำถามย่อย 2 ข้อ ให้พิมพ์คำตอบที่ 1 และ คำตอบที่ 2 เรียงตามลำดับ
        </li>
            <br />
        <li>4 ในคำถามที่มี (…) ด้านหลังให้ตอบในรูปแบบตาม (…) ที่กำหนด ซึ่งได้แก่ (Technical Term) ตอบเป็นคำศัพท์เฉพาะทางการแพทย์ภาษาอังกฤษ หรือสามารถย่อตามหลักสากลได้ และ (Full name) ตอบเป็นชื่อเต็มภาษาอังกฤษเท่านั้น ซึ่งจะต้องสะกดถูกทุกตัวอักษรจึงจะได้คะแนน</li>
            <br />

        <li>4 ให้ทุกข้อตอบเป็น Technical Term คำศัพท์เฉพาะทางการแพทย์ภาษาอังกฤษแบบเต็มหรือสามารถย่อตามหลักสากลได้และต้องสะกดถูกทุกตัวอักษรจึงจะได้คะแนน ยกเว้นข้อที่มีตัวเลือกให้ ให้ตอบตามตัวเลือกที่มี
        </li>
            <br />
        <li>5 การชาเล้นจ์หรืออุธรณ์คำตอบ สามารถทำได้หลังจากที่คณะกรรมการเฉลยคำตอบเสร็จสิ้น
        </li>
            <br />
        <li>6 เมื่อครบ 4 เคสแล้ว กรณีที่ไม่สามารถตัดสินผลการแข่งขันได้ จะมีคำถามสำรองจากนิทรรศการ 2 ข้อ หากยังไม่สามารถตัดสินได้จะพิจารณาคะแนนรวมของรอบคัดเลือกเป็นลำดับต่อไป</li>
            <br />
        <li>7 หากเกิดปัญหาขึ้นเกี่ยวกับการทำข้อสอบ การส่งคำตอบ การแสดงคะแนนไม่ถูกต้อง ให้แจ้งผู้คุมแข่งขันประจำทีมของตนเองและรอการตอบกลับ (ผู้คุมแข่งขันจะไม่ตอบปัญหาที่เกี่ยวข้องกับคำถามและคำตอบ)</li>
            <br />
    </ul>
    </div>


 </div>
);
}

export default DisplayRuleFinal