import React from "react";
import { Card } from "react-daisyui";

function DisplayRule() {


return (
 <div className="flex flex-col items-center justify-center min-h-screen bg-white-blur text-gray-700 p-2 gap-5">
    <div  className="p-0 rounded-lg text-white shadow-2xl text-center text-5xl opacity-70 animate__animated animate__fadeIn" style={{ animationDelay: "500ms" }}>
        <strong><p className="text-md">กติกาการแข่ง รอบ SemiFinal</p></strong>
    </div>
    <div className="bg-white ml-10 mr-10 p-10 rounded-lg animate__animated animate__fadeIn" style={{ animationDelay: "1000ms",fontSize: '1rem'}}>
    <ul>
        <li>1 การตอบคำถามในรอบรองชนะเลิศ เป็นการพิมพ์คำตอบอัตนัยแบบสั้น หรือ short answer ลงในแท็ปเล็ตภายในระยะเวลาที่กำหนด และต้องกดปุ่ม SAVE เพื่อบันทึกคำตอบอีกครั้ง ซึ่งจะเริ่มพิมพ์ได้หลังจากพิธีกรอ่านคำถามจบ</li>
            <br />
        <li>2 ผู้เข้าแข่งขันสามารถจดบันทึกหรือทดลงบนไวท์บอร์ดที่จัดเตรียมไว้ได้</li>
            <br />
        <li>3 หากข้อใดมีคำถามย่อย 2 ข้อ ให้พิมพ์คำตอบที่ 1 และ คำตอบที่ 2 เรียงตามลำดับ ผู้เข้าแข่งขันจำเป็นต้องตอบถูกทั้งหมดจึงจะได้คะแนนในข้อนั้น</li>
            <br />
        <li>4 ในคำถามที่มี (…) ด้านหลังให้ตอบในรูปแบบตาม (…) ที่กำหนด ซึ่งได้แก่ (Technical Term) ตอบเป็นคำศัพท์เฉพาะทางการแพทย์ภาษาอังกฤษ หรือสามารถย่อตามหลักสากลได้ และ (Full name) ตอบเป็นชื่อเต็มภาษาอังกฤษเท่านั้น ซึ่งจะต้องสะกดถูกทุกตัวอักษรจึงจะได้คะแนน</li>
            <br />

        <li>5 ในรอบรองชนะเลิศ ทุกทีมจะได้รับไอเท็มตัวช่วย x2 และ x3 แต่ละทีมสามารถใช้ไอเทมได้อย่างละ 1 ครั้ง โดยแจ้งให้ผู้คุมแข่งขันก่อนที่จะปล่อยคำถาม</li>
            <br />
        <li>6 การชาเล้นจ์คำตอบหรือการอุทธรณ์ข้อสอบสามารถทำได้โดยการบอกกับผู้คุมแข่งขันประจำทีมหลังจากที่คณะกรรมการเฉลยคำตอบเสร็จสิ้นแล้ว</li>
            <br />
        <li>7. เมื่อครบ 18 ข้อแล้ว กรณีทีมอันดับที่ 3 มีคะแนนรวมเท่ากัน จะมีคำถามสำรองจากนิทรรศการ 2 ข้อ หากยังไม่สามารถตัดสินได้จะพิจารณาคะแนนรวมของรอบคัดเลือกเป็นลำดับต่อไป</li>
            <br />
        <li>8 หากเกิดปัญหาขึ้นเกี่ยวกับการทำข้อสอบ การส่งคำตอบ การแสดงคะแนนไม่ถูกต้อง ให้แจ้งผู้คุมแข่งขันประจำทีมของตนเองและรอการตอบกลับ (ผู้คุมแข่งขันจะไม่ตอบปัญหาที่เกี่ยวข้องกับคำถามและคำตอบ)</li>
            <br />
    </ul>
    </div>

 

 </div>
);
}

export default DisplayRule