-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Sep 16, 2025 at 10:20 AM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `mahidolquiz`
--

-- --------------------------------------------------------

--
-- Table structure for table `answer`
--

CREATE TABLE `answer` (
  `user_id` varchar(50) DEFAULT NULL,
  `answer` longtext DEFAULT NULL,
  `question_id` varchar(50) DEFAULT NULL,
  `createdDateTime` datetime(3) DEFAULT current_timestamp(3),
  `score` decimal(20,2) DEFAULT NULL,
  `flower_modified_score` decimal(10,2) DEFAULT 0.00,
  `is_early_submission` tinyint(1) DEFAULT 0,
  `is_rewards` tinyint(1) DEFAULT 0,
  `flower_no` int(11) NOT NULL DEFAULT 0,
  `is_protect` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `answer`
--

INSERT INTO `answer` (`user_id`, `answer`, `question_id`, `createdDateTime`, `score`, `flower_modified_score`, `is_early_submission`, `is_rewards`, `flower_no`, `is_protect`) VALUES
('semi01', 'sdjkajsdkasdks', 'FINAL Q1.1', '2025-09-16 10:44:12.844', 10.00, 10.00, 0, 1, 5, 0),
('semi03', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:44:12.856', 0.00, 0.00, 0, 1, 5, 0),
('semi02', 'sdada', 'FINAL Q1.1', '2025-09-16 10:44:12.863', 0.00, 0.00, 0, 1, 5, 0),
('semi07', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:44:12.864', 10.00, 10.00, 0, 1, 5, 0),
('semi04', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:44:12.866', 10.00, 10.00, 0, 1, 5, 0),
('semi06', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:44:12.866', 0.00, 0.00, 0, 1, 5, 0),
('semi08', 'Assad', 'FINAL Q1.1', '2025-09-16 10:44:12.867', 0.00, 0.00, 0, 1, 5, 0),
('semi05', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:44:12.869', 10.00, 10.00, 0, 1, 5, 0);

-- --------------------------------------------------------

--
-- Table structure for table `answer_log`
--

CREATE TABLE `answer_log` (
  `user_id` varchar(50) DEFAULT NULL,
  `answer` longtext DEFAULT NULL,
  `question_id` varchar(50) DEFAULT NULL,
  `createdDateTime` datetime(3) DEFAULT current_timestamp(3)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `answer_log`
--

INSERT INTO `answer_log` (`user_id`, `answer`, `question_id`, `createdDateTime`) VALUES
('semi02', 'sdada', 'FINAL Q1.1', '2025-09-16 10:42:52.744'),
('semi01', 'sdaadsda', 'FINAL Q1.1', '2025-09-16 10:42:52.756'),
('semi03', 'a', 'FINAL Q1.1', '2025-09-16 10:42:52.861'),
('semi03', 'as', 'FINAL Q1.1', '2025-09-16 10:42:52.894'),
('semi03', 'asd', 'FINAL Q1.1', '2025-09-16 10:42:52.977'),
('semi03', 'asda', 'FINAL Q1.1', '2025-09-16 10:42:53.117'),
('semi03', 'asdas', 'FINAL Q1.1', '2025-09-16 10:42:53.186'),
('semi03', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:42:53.257'),
('semi06', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:42:57.746'),
('semi07', 'as', 'FINAL Q1.1', '2025-09-16 10:42:57.746'),
('semi07', 'asd', 'FINAL Q1.1', '2025-09-16 10:42:57.749'),
('semi05', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:42:57.754'),
('semi01', 'sdaadsda', 'FINAL Q1.1', '2025-09-16 10:42:57.756'),
('semi02', 'sdada', 'FINAL Q1.1', '2025-09-16 10:42:57.757'),
('semi04', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:42:57.758'),
('semi07', 'asda', 'FINAL Q1.1', '2025-09-16 10:42:57.863'),
('semi03', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:42:57.864'),
('semi07', 'asdas', 'FINAL Q1.1', '2025-09-16 10:42:57.953'),
('semi07', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:42:57.979'),
('semi01', 'sdaadsda', 'FINAL Q1.1', '2025-09-16 10:43:02.750'),
('semi02', 'sdada', 'FINAL Q1.1', '2025-09-16 10:43:02.754'),
('semi08', 'Assad', 'FINAL Q1.1', '2025-09-16 10:43:02.758'),
('semi04', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:02.758'),
('semi03', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:02.760'),
('semi05', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:02.760'),
('semi07', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:02.762'),
('semi06', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:02.843'),
('semi01', 'sdaadsda', 'FINAL Q1.1', '2025-09-16 10:43:07.763'),
('semi03', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:07.785'),
('semi06', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:07.785'),
('semi02', 'sdada', 'FINAL Q1.1', '2025-09-16 10:43:07.786'),
('semi07', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:07.787'),
('semi04', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:07.788'),
('semi05', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:07.833'),
('semi08', 'Assad', 'FINAL Q1.1', '2025-09-16 10:43:07.848'),
('semi02', 'sdada', 'FINAL Q1.1', '2025-09-16 10:43:12.781'),
('semi03', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:12.782'),
('semi07', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:12.782'),
('semi05', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:12.784'),
('semi04', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:12.785'),
('semi01', 'sdaadsda', 'FINAL Q1.1', '2025-09-16 10:43:12.789'),
('semi06', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:12.790'),
('semi08', 'Assad', 'FINAL Q1.1', '2025-09-16 10:43:12.794'),
('semi01', 'sdaadsda', 'FINAL Q1.1', '2025-09-16 10:43:17.785'),
('semi06', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:17.786'),
('semi02', 'sdada', 'FINAL Q1.1', '2025-09-16 10:43:17.790'),
('semi05', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:17.790'),
('semi03', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:17.790'),
('semi04', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:17.791'),
('semi08', 'Assad', 'FINAL Q1.1', '2025-09-16 10:43:17.792'),
('semi07', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:17.794'),
('semi02', 'sdada', 'FINAL Q1.1', '2025-09-16 10:43:22.785'),
('semi05', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:22.785'),
('semi06', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:22.785'),
('semi07', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:22.789'),
('semi03', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:22.791'),
('semi04', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:22.798'),
('semi08', 'Assad', 'FINAL Q1.1', '2025-09-16 10:43:22.799'),
('semi01', 'sdaadsda', 'FINAL Q1.1', '2025-09-16 10:43:22.873'),
('semi05', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:27.791'),
('semi06', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:27.795'),
('semi03', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:27.795'),
('semi08', 'Assad', 'FINAL Q1.1', '2025-09-16 10:43:27.795'),
('semi07', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:27.802'),
('semi02', 'sdada', 'FINAL Q1.1', '2025-09-16 10:43:27.805'),
('semi01', 'sdaadsda', 'FINAL Q1.1', '2025-09-16 10:43:27.805'),
('semi04', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:27.805'),
('semi05', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:32.786'),
('semi04', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:32.787'),
('semi02', 'sdada', 'FINAL Q1.1', '2025-09-16 10:43:32.795'),
('semi08', 'Assad', 'FINAL Q1.1', '2025-09-16 10:43:32.811'),
('semi06', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:32.811'),
('semi07', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:32.811'),
('semi03', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:32.811'),
('semi01', 'sdaadsda', 'FINAL Q1.1', '2025-09-16 10:43:32.814'),
('semi01', 'sdaadsda', 'FINAL Q1.1', '2025-09-16 10:43:37.805'),
('semi04', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:37.805'),
('semi03', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:37.808'),
('semi06', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:37.809'),
('semi07', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:37.810'),
('semi08', 'Assad', 'FINAL Q1.1', '2025-09-16 10:43:37.812'),
('semi02', 'sdada', 'FINAL Q1.1', '2025-09-16 10:43:37.812'),
('semi05', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:37.817'),
('semi02', 'sdada', 'FINAL Q1.1', '2025-09-16 10:43:42.809'),
('semi01', 'sdaadsda', 'FINAL Q1.1', '2025-09-16 10:43:42.811'),
('semi05', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:42.816'),
('semi03', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:42.817'),
('semi06', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:42.824'),
('semi07', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:42.824'),
('semi04', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:42.828'),
('semi08', 'Assad', 'FINAL Q1.1', '2025-09-16 10:43:42.828'),
('semi01', 'sdaadsda', 'FINAL Q1.1', '2025-09-16 10:43:47.817'),
('semi03', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:47.827'),
('semi07', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:47.826'),
('semi05', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:47.829'),
('semi06', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:47.829'),
('semi04', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:47.830'),
('semi02', 'sdada', 'FINAL Q1.1', '2025-09-16 10:43:47.830'),
('semi08', 'Assad', 'FINAL Q1.1', '2025-09-16 10:43:47.831'),
('semi01', 'sdaadsda', 'FINAL Q1.1', '2025-09-16 10:43:52.812'),
('semi02', 'sdada', 'FINAL Q1.1', '2025-09-16 10:43:52.814'),
('semi03', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:52.814'),
('semi06', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:52.816'),
('semi08', 'Assad', 'FINAL Q1.1', '2025-09-16 10:43:52.816'),
('semi05', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:52.817'),
('semi04', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:52.818'),
('semi07', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:52.820'),
('semi01', 'sdaadsda', 'FINAL Q1.1', '2025-09-16 10:43:57.815'),
('semi06', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:57.835'),
('semi02', 'sdada', 'FINAL Q1.1', '2025-09-16 10:43:57.835'),
('semi04', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:57.835'),
('semi05', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:57.838'),
('semi07', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:57.838'),
('semi08', 'Assad', 'FINAL Q1.1', '2025-09-16 10:43:57.840'),
('semi03', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:43:57.843'),
('semi01', 'sdjkajsdkasdks', 'FINAL Q1.1', '2025-09-16 10:44:02.822'),
('semi03', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:44:02.845'),
('semi07', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:44:02.847'),
('semi05', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:44:02.848'),
('semi04', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:44:02.849'),
('semi08', 'Assad', 'FINAL Q1.1', '2025-09-16 10:44:02.849'),
('semi06', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:44:02.850'),
('semi02', 'sdada', 'FINAL Q1.1', '2025-09-16 10:44:02.850'),
('semi01', 'sdjkajsdkasdks', 'FINAL Q1.1', '2025-09-16 10:44:07.827'),
('semi02', 'sdada', 'FINAL Q1.1', '2025-09-16 10:44:07.831'),
('semi03', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:44:07.840'),
('semi08', 'Assad', 'FINAL Q1.1', '2025-09-16 10:44:07.840'),
('semi04', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:44:07.842'),
('semi05', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:44:07.842'),
('semi07', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:44:07.845'),
('semi06', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:44:07.845'),
('semi01', 'sdjkajsdkasdks', 'FINAL Q1.1', '2025-09-16 10:44:12.834'),
('semi03', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:44:12.842'),
('semi04', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:44:12.849'),
('semi07', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:44:12.852'),
('semi02', 'sdada', 'FINAL Q1.1', '2025-09-16 10:44:12.858'),
('semi08', 'Assad', 'FINAL Q1.1', '2025-09-16 10:44:12.859'),
('semi05', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:44:12.863'),
('semi06', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:44:12.874'),
('semi01', 'sdjkajsdkasdks', 'FINAL Q1.1', '2025-09-16 10:44:17.839'),
('semi03', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:44:17.840'),
('semi02', 'sdada', 'FINAL Q1.1', '2025-09-16 10:44:17.852'),
('semi05', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:44:17.858'),
('semi06', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:44:17.860'),
('semi04', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:44:17.861'),
('semi07', 'asdasd', 'FINAL Q1.1', '2025-09-16 10:44:17.863'),
('semi08', 'Assad', 'FINAL Q1.1', '2025-09-16 10:44:17.864');

-- --------------------------------------------------------

--
-- Table structure for table `flower_states`
--

CREATE TABLE `flower_states` (
  `team_id` varchar(50) NOT NULL,
  `current_units` int(11) DEFAULT NULL CHECK (`current_units` between 3 and 7),
  `updated_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `update_reason` varchar(100) DEFAULT NULL,
  `now_item` enum('SHIELD','REVIVE','ADD','NONE') NOT NULL DEFAULT 'NONE',
  `is_send` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `flower_states`
--

INSERT INTO `flower_states` (`team_id`, `current_units`, `updated_at`, `update_reason`, `now_item`, `is_send`) VALUES
('semi01', 5, '2025-09-16 08:09:38', NULL, 'NONE', 0),
('semi02', 4, '2025-09-16 08:13:33', NULL, 'NONE', 0),
('semi03', 4, '2025-09-16 08:13:35', NULL, 'NONE', 0),
('semi04', 5, '2025-09-16 08:20:12', NULL, 'NONE', 0),
('semi05', 5, '2025-09-16 08:12:28', NULL, 'NONE', 0),
('semi06', 4, '2025-09-16 08:13:34', NULL, 'NONE', 0),
('semi07', 5, '2025-09-16 08:20:16', NULL, 'NONE', 0),
('semi08', 4, '2025-09-16 08:20:15', NULL, 'NONE', 0);

-- --------------------------------------------------------

--
-- Table structure for table `flower_state_history`
--

CREATE TABLE `flower_state_history` (
  `id` int(11) NOT NULL,
  `team_id` varchar(50) DEFAULT NULL,
  `previous_units` int(11) DEFAULT NULL,
  `new_units` int(11) DEFAULT NULL,
  `change_reason` varchar(100) DEFAULT NULL,
  `question_id` varchar(50) DEFAULT NULL,
  `changed_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `flower_state_history`
--

INSERT INTO `flower_state_history` (`id`, `team_id`, `previous_units`, `new_units`, `change_reason`, `question_id`, `changed_at`) VALUES
(1, 'semi01', 5, 5, 'ไม่มีการเปลี่ยนแปลงดอกไม้ หรือผลจากไอเท็ม', 'FINAL Q1.1', '2025-09-16 08:09:38'),
(2, 'semi02', 5, 5, 'ไม่มีการเปลี่ยนแปลงดอกไม้ หรือผลจากไอเท็ม', 'FINAL Q1.1', '2025-09-16 08:09:39'),
(3, 'semi03', 5, 5, 'ไม่มีการเปลี่ยนแปลงดอกไม้ หรือผลจากไอเท็ม', 'FINAL Q1.1', '2025-09-16 08:12:24'),
(4, 'semi04', 5, 5, 'ไม่มีการเปลี่ยนแปลงดอกไม้ หรือผลจากไอเท็ม', 'FINAL Q1.1', '2025-09-16 08:12:25'),
(5, 'semi08', 5, 5, 'ไม่มีการเปลี่ยนแปลงดอกไม้ หรือผลจากไอเท็ม', 'FINAL Q1.1', '2025-09-16 08:12:25'),
(6, 'semi07', 5, 5, 'ไม่มีการเปลี่ยนแปลงดอกไม้ หรือผลจากไอเท็ม', 'FINAL Q1.1', '2025-09-16 08:12:26'),
(7, 'semi06', 5, 5, 'ไม่มีการเปลี่ยนแปลงดอกไม้ หรือผลจากไอเท็ม', 'FINAL Q1.1', '2025-09-16 08:12:27'),
(8, 'semi05', 5, 5, 'ไม่มีการเปลี่ยนแปลงดอกไม้ หรือผลจากไอเท็ม', 'FINAL Q1.1', '2025-09-16 08:12:28'),
(9, 'semi02', 5, 4, 'ลดดอกไม้เนื่องจากคำตอบไม่ถูกต้อง -1 ดอก', 'FINAL Q1.1', '2025-09-16 08:13:33'),
(10, 'semi06', 5, 4, 'ลดดอกไม้เนื่องจากคำตอบไม่ถูกต้อง -1 ดอก', 'FINAL Q1.1', '2025-09-16 08:13:34'),
(11, 'semi03', 5, 4, 'ลดดอกไม้เนื่องจากคำตอบไม่ถูกต้อง -1 ดอก', 'FINAL Q1.1', '2025-09-16 08:13:35'),
(12, 'semi07', 5, 4, 'ลดดอกไม้เนื่องจากคำตอบไม่ถูกต้อง -1 ดอก', 'FINAL Q1.1', '2025-09-16 08:13:36'),
(13, 'semi04', 5, 4, 'ลดดอกไม้เนื่องจากคำตอบไม่ถูกต้อง -1 ดอก', 'FINAL Q1.1', '2025-09-16 08:20:11'),
(14, 'semi04', 5, 5, 'ไม่มีการเปลี่ยนแปลงดอกไม้ หรือผลจากไอเท็ม', 'FINAL Q1.1', '2025-09-16 08:20:12'),
(15, 'semi08', 5, 5, 'ไม่มีการเปลี่ยนแปลงดอกไม้ หรือผลจากไอเท็ม', 'FINAL Q1.1', '2025-09-16 08:20:14'),
(16, 'semi08', 5, 5, 'ไม่มีการเปลี่ยนแปลงดอกไม้ หรือผลจากไอเท็ม', 'FINAL Q1.1', '2025-09-16 08:20:14'),
(17, 'semi08', 5, 4, 'ลดดอกไม้เนื่องจากคำตอบไม่ถูกต้อง -1 ดอก', 'FINAL Q1.1', '2025-09-16 08:20:15'),
(18, 'semi08', 5, 4, 'ลดดอกไม้เนื่องจากคำตอบไม่ถูกต้อง -1 ดอก', 'FINAL Q1.1', '2025-09-16 08:20:15'),
(19, 'semi08', 5, 4, 'ลดดอกไม้เนื่องจากคำตอบไม่ถูกต้อง -1 ดอก', 'FINAL Q1.1', '2025-09-16 08:20:15'),
(20, 'semi07', 5, 5, 'ไม่มีการเปลี่ยนแปลงดอกไม้ หรือผลจากไอเท็ม', 'FINAL Q1.1', '2025-09-16 08:20:16');

-- --------------------------------------------------------

--
-- Table structure for table `item_usage`
--

CREATE TABLE `item_usage` (
  `id` int(11) NOT NULL,
  `team_id` varchar(50) DEFAULT NULL,
  `item_type` enum('ADD','REVIVE','SHIELD') DEFAULT NULL,
  `question_id` varchar(50) DEFAULT NULL,
  `used_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `is_used` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `item_usage`
--

INSERT INTO `item_usage` (`id`, `team_id`, `item_type`, `question_id`, `used_at`, `is_used`) VALUES
(1, 'semi01', 'ADD', 'FINAL Q1.1', '2025-09-14 15:46:14', 2),
(2, 'semi01', 'REVIVE', 'FINAL Q1.3', '2025-09-14 15:46:14', 1),
(3, 'semi01', 'SHIELD', 'FINAL Q1.1', '2025-09-14 16:01:13', 1),
(5, 'semi02', 'ADD', 'DEFAULT_Q', '2025-09-16 07:01:14', 2),
(6, 'semi02', 'REVIVE', 'DEFAULT_Q', '2025-09-16 07:01:14', 1),
(7, 'semi02', 'SHIELD', 'DEFAULT_Q', '2025-09-16 07:01:14', 1),
(8, 'semi03', 'ADD', 'DEFAULT_Q', '2025-09-16 07:01:14', 2),
(9, 'semi03', 'REVIVE', 'DEFAULT_Q', '2025-09-16 07:01:14', 1),
(10, 'semi03', 'SHIELD', 'DEFAULT_Q', '2025-09-16 07:01:14', 1),
(11, 'semi04', 'ADD', 'DEFAULT_Q', '2025-09-16 07:01:14', 2),
(12, 'semi04', 'REVIVE', 'DEFAULT_Q', '2025-09-16 07:01:14', 1),
(13, 'semi04', 'SHIELD', 'DEFAULT_Q', '2025-09-16 07:01:14', 1),
(14, 'semi05', 'ADD', 'DEFAULT_Q', '2025-09-16 07:01:14', 2),
(15, 'semi05', 'REVIVE', 'DEFAULT_Q', '2025-09-16 07:01:14', 1),
(16, 'semi05', 'SHIELD', 'DEFAULT_Q', '2025-09-16 07:01:14', 1),
(17, 'semi06', 'ADD', 'DEFAULT_Q', '2025-09-16 07:01:14', 2),
(18, 'semi06', 'REVIVE', 'DEFAULT_Q', '2025-09-16 07:01:14', 1),
(19, 'semi06', 'SHIELD', 'DEFAULT_Q', '2025-09-16 07:01:14', 1),
(20, 'semi07', 'ADD', 'DEFAULT_Q', '2025-09-16 07:01:14', 2),
(21, 'semi07', 'REVIVE', 'DEFAULT_Q', '2025-09-16 07:01:14', 1),
(22, 'semi07', 'SHIELD', 'DEFAULT_Q', '2025-09-16 07:01:14', 1),
(23, 'semi08', 'ADD', 'DEFAULT_Q', '2025-09-16 07:01:14', 2),
(24, 'semi08', 'REVIVE', 'DEFAULT_Q', '2025-09-16 07:01:14', 1),
(25, 'semi08', 'SHIELD', 'DEFAULT_Q', '2025-09-16 07:01:14', 1);

-- --------------------------------------------------------

--
-- Table structure for table `questions`
--

CREATE TABLE `questions` (
  `id` varchar(50) DEFAULT NULL,
  `type` varchar(50) DEFAULT NULL,
  `majorq` varchar(1000) DEFAULT NULL,
  `majorpics` varchar(100) DEFAULT NULL,
  `text` varchar(1000) DEFAULT NULL,
  `pics` varchar(100) DEFAULT NULL,
  `level` varchar(50) DEFAULT NULL,
  `score` int(4) DEFAULT NULL,
  `time` int(3) DEFAULT NULL,
  `section` varchar(1) DEFAULT NULL,
  `isSelected` int(1) DEFAULT NULL,
  `sequence` int(2) DEFAULT NULL,
  `correct_answer` varchar(300) DEFAULT NULL,
  `correct_answer_description` varchar(1000) DEFAULT NULL,
  `correct_answer_photo` varchar(50) DEFAULT NULL,
  `underline` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `questions`
--

INSERT INTO `questions` (`id`, `type`, `majorq`, `majorpics`, `text`, `pics`, `level`, `score`, `time`, `section`, `isSelected`, `sequence`, `correct_answer`, `correct_answer_description`, `correct_answer_photo`, `underline`) VALUES
('Case 1 ความลับในจานดิบ', 'FINAL', 'ผู้ป่วยชายอายุ 58 ปี มีอาการท้องอืด ไม่อยากอาหาร คันตามผิวหนัง และมีไข้ต่ำ ๆ แพทย์ตรวจร่างกายพบว่า ผู้ป่วยตัวเหลือง ตาเหลือง ตับโตขึ้นเล็กน้อย จากการซักประวัติ ผู้ป่วยไม่มีโรคประจำตัว และปฏิเสธการแพ้ ไม่เคยเดินทางออกนอกประเทศ ดื่มเครื่องดื่มแอลกอฮอล์บ้างเป็นครั้งคราว และชอบกินลาบปลาดิบเป็นประจำ แพทย์สงสัยการติดเชื้อพยาธิของระบบทางเดินอาหาร จึงสั่งเก็บอุจจาระเพื่อส่งตรวจทางห้องปฏิบัติการและทางกล้องจุลทรรศน์ต่อไป ', NULL, NULL, NULL, 'final', 100, NULL, 'N', NULL, NULL, 'NULL', NULL, NULL, NULL),
('FINAL Q1.1', 'FINAL', 'ผู้ป่วยชายอายุ 58 ปี มีอาการท้องอืด ไม่อยากอาหาร คันตามผิวหนัง และมีไข้ต่ำ ๆ แพทย์ตรวจร่างกายพบว่า ผู้ป่วยตัวเหลือง ตาเหลือง ตับโตขึ้นเล็กน้อย จากการซักประวัติ ผู้ป่วยไม่มีโรคประจำตัว และปฏิเสธการแพ้ ไม่เคยเดินทางออกนอกประเทศ ดื่มเครื่องดื่มแอลกอฮอล์บ้างเป็นครั้งคราว และชอบกินลาบปลาดิบเป็นประจำ แพทย์สงสัยการติดเชื้อพยาธิของระบบทางเดินอาหาร จึงสั่งเก็บอุจจาระเพื่อส่งตรวจทางห้องปฏิบัติการและทางกล้องจุลทรรศน์ต่อไป ', NULL, 'Q1.1) อาการตัวเหลือง ตาเหลือง ตับโต และอาการคันตามผิวหนังของผู้ป่วยรายนี้ เกิดจากการสะสมของสารใดในร่างกาย (10 คะแนน)', NULL, 'final', 10, 90, NULL, NULL, NULL, 'Indirect bilirubin / Direct bilirubin / Conjugated bilirubin / Unconjugated bilirubin / Bilirubin', NULL, NULL, NULL),
('FINAL Q1.2', 'FINAL', 'ผู้ป่วยชายอายุ 58 ปี มีอาการท้องอืด ไม่อยากอาหาร คันตามผิวหนัง และมีไข้ต่ำ ๆ แพทย์ตรวจร่างกายพบว่า ผู้ป่วยตัวเหลือง ตาเหลือง ตับโตขึ้นเล็กน้อย จากการซักประวัติ ผู้ป่วยไม่มีโรคประจำตัว และปฏิเสธการแพ้ ไม่เคยเดินทางออกนอกประเทศ ดื่มเครื่องดื่มแอลกอฮอล์บ้างเป็นครั้งคราว และชอบกินลาบปลาดิบเป็นประจำ แพทย์สงสัยการติดเชื้อพยาธิของระบบทางเดินอาหาร จึงสั่งเก็บอุจจาระเพื่อส่งตรวจทางห้องปฏิบัติการและทางกล้องจุลทรรศน์ต่อไป ', NULL, 'Q1.2) เพื่อยืนยันภาวะ jaundice แพทย์จึงได้ส่งตรวจ liver function test พบว่า\n - Total bilirubin สูงกว่าปกติ\n - Conjugated bilirubin > Unconjugated bilirubin\n - ALP (Alkaline phosphatase) และ GGT (Gamma-Glutamyl Transpeptidase) สูงกว่าปกติ\n จากผลตรวจดังกล่าว บ่งชี้ความผิดปกติของโครงสร้างใด (20 คะแนน)', NULL, 'final', 20, 90, 'N', NULL, NULL, 'Bile duct / Biliary tree / Intrahepatic bile duct  ', NULL, NULL, NULL),
('FINAL Q1.3', 'FINAL', 'ผู้ป่วยชายอายุ 58 ปี มีอาการท้องอืด ไม่อยากอาหาร คันตามผิวหนัง และมีไข้ต่ำ ๆ แพทย์ตรวจร่างกายพบว่า ผู้ป่วยตัวเหลือง ตาเหลือง ตับโตขึ้นเล็กน้อย จากการซักประวัติ ผู้ป่วยไม่มีโรคประจำตัว และปฏิเสธการแพ้ ไม่เคยเดินทางออกนอกประเทศ ดื่มเครื่องดื่มแอลกอฮอล์บ้างเป็นครั้งคราว และชอบกินลาบปลาดิบเป็นประจำ แพทย์สงสัยการติดเชื้อพยาธิของระบบทางเดินอาหาร จึงสั่งเก็บอุจจาระเพื่อส่งตรวจทางห้องปฏิบัติการและทางกล้องจุลทรรศน์ต่อไป ', NULL, 'Q1.3) จากการตรวจตัวอย่างอุจจาระทางกล้องจุลทรรศน์ พบไข่ของพยาธิลักษณะดังภาพ จงเขียนชื่อเต็มทางวิทยาศาสตร์ของเชื้อชนิดนี้ให้ถูกต้อง (25 คะแนน)', 'Q1.3.png', 'final', 25, 90, 'N', NULL, NULL, 'Opisthorchis viverrini ', NULL, NULL, NULL),
('FINAL Q1.4', 'FINAL', 'ผู้ป่วยชายอายุ 58 ปี มีอาการท้องอืด ไม่อยากอาหาร คันตามผิวหนัง และมีไข้ต่ำ ๆ แพทย์ตรวจร่างกายพบว่า ผู้ป่วยตัวเหลือง ตาเหลือง ตับโตขึ้นเล็กน้อย จากการซักประวัติ ผู้ป่วยไม่มีโรคประจำตัว และปฏิเสธการแพ้ ไม่เคยเดินทางออกนอกประเทศ ดื่มเครื่องดื่มแอลกอฮอล์บ้างเป็นครั้งคราว และชอบกินลาบปลาดิบเป็นประจำ แพทย์สงสัยการติดเชื้อพยาธิของระบบทางเดินอาหาร จึงสั่งเก็บอุจจาระเพื่อส่งตรวจทางห้องปฏิบัติการและทางกล้องจุลทรรศน์ต่อไป ', NULL, 'Q1.4) พยาธิชนิดนี้มี first intermediate host เป็นอะไร (15 คะแนน)', NULL, 'final', 15, 90, NULL, NULL, NULL, 'Bithynia spp. / Freshwater Snail ', NULL, NULL, NULL),
('FINAL Q1.5', 'FINAL', 'ผู้ป่วยชายอายุ 58 ปี มีอาการท้องอืด ไม่อยากอาหาร คันตามผิวหนัง และมีไข้ต่ำ ๆ แพทย์ตรวจร่างกายพบว่า ผู้ป่วยตัวเหลือง ตาเหลือง ตับโตขึ้นเล็กน้อย จากการซักประวัติ ผู้ป่วยไม่มีโรคประจำตัว และปฏิเสธการแพ้ ไม่เคยเดินทางออกนอกประเทศ ดื่มเครื่องดื่มแอลกอฮอล์บ้างเป็นครั้งคราว และชอบกินลาบปลาดิบเป็นประจำ แพทย์สงสัยการติดเชื้อพยาธิของระบบทางเดินอาหาร จึงสั่งเก็บอุจจาระเพื่อส่งตรวจทางห้องปฏิบัติการและทางกล้องจุลทรรศน์ต่อไป ', NULL, 'Q1.5) 5 ปีต่อมา พบว่าผู้ป่วยมีอาการตัวเหลืองมากขึ้น แพทย์จึงทำการเก็บชิ้นเนื้อตับและท่อน้ำดีส่งตรวจทางพยาธิวิทยา พบเซลล์ท่อน้ำดีแบ่งตัวผิดปกติ ผู้ป่วยมีโอกาสเกิดภาวะแทรกซ้อนรุนแรงใด ที่เป็นผลจากการติดเชื้อพยาธิชนิดนี้ (30 คะแนน)', NULL, 'final', 30, 90, NULL, NULL, NULL, 'Cholangiocarcinoma', NULL, NULL, NULL),
('Case 2 ปอดที่โรยแรง', 'FINAL', 'ชายอายุ 67 ปี อาศัยอยู่ที่จังหวัดเชียงใหม่ มาพบแพทย์ด้วยอาการหายใจหอบเหนื่อย ประวัติของผู้ป่วยในระยะเวลา 2 ปีที่ผ่านมา มีอาการไอเรื้อรังแบบมีเสมหะหลายรอบ รอบละประมาณ 3-5 เดือน จากการซักประวัติเพิ่มเติม ผู้ป่วยสูบบุหรี่มาตั้งแต่วัยรุ่น ตรวจร่างกายเบื้องต้นพบภาวะ mild cyanosis ของผิวหนัง ริมฝีปาก และเล็บ มีเมือกในทางเดินหายใจปริมาณมาก และวัดสัญญาณชีพต่าง ๆ ได้ดังนี้ \n อัตราการเต้นของหัวใจ : 94 bpm, ความดันโลหิต : 130/90 mmHg, อัตราการหายใจ : 20 breaths/min และอุณหภูมิร่างกาย : 36.5 องศาเซลเซียส', NULL, NULL, NULL, 'final', 100, NULL, 'N', NULL, NULL, 'NULL', NULL, NULL, NULL),
('FINAL Q2.1', 'FINAL', 'ชายอายุ 67 ปี อาศัยอยู่ที่จังหวัดเชียงใหม่ มาพบแพทย์ด้วยอาการหายใจหอบเหนื่อย ประวัติของผู้ป่วยในระยะเวลา 2 ปีที่ผ่านมา มีอาการไอเรื้อรังแบบมีเสมหะหลายรอบ รอบละประมาณ 3-5 เดือน จากการซักประวัติเพิ่มเติม ผู้ป่วยสูบบุหรี่มาตั้งแต่วัยรุ่น ตรวจร่างกายเบื้องต้นพบภาวะ mild cyanosis ของผิวหนัง ริมฝีปาก และเล็บ มีเมือกในทางเดินหายใจปริมาณมาก และวัดสัญญาณชีพต่าง ๆ ได้ดังนี้ \n อัตราการเต้นของหัวใจ : 94 bpm, ความดันโลหิต : 130/90 mmHg, อัตราการหายใจ : 20 breaths/min และอุณหภูมิร่างกาย : 36.5 องศาเซลเซียส', NULL, 'Q2.1) อาการของผู้ป่วยรายนี้เกิดจากการทำงานที่ผิดปกติของโครงสร้างใดของเซลล์เยื่อบุผิวในระบบทางเดินหายใจ (10 คะแนน) และผู้ป่วยมีแนวโน้มเป็นโรคใดมากที่สุด (10 คะแนน)', NULL, 'final', 20, 90, NULL, NULL, NULL, '- โครงสร้าง Cilia \n - โรค Chronic bronchitis', NULL, NULL, NULL),
('FINAL Q2.2', 'FINAL', 'ชายอายุ 67 ปี อาศัยอยู่ที่จังหวัดเชียงใหม่ มาพบแพทย์ด้วยอาการหายใจหอบเหนื่อย ประวัติของผู้ป่วยในระยะเวลา 2 ปีที่ผ่านมา มีอาการไอเรื้อรังแบบมีเสมหะหลายรอบ รอบละประมาณ 3-5 เดือน จากการซักประวัติเพิ่มเติม ผู้ป่วยสูบบุหรี่มาตั้งแต่วัยรุ่น ตรวจร่างกายเบื้องต้นพบภาวะ mild cyanosis ของผิวหนัง ริมฝีปาก และเล็บ มีเมือกในทางเดินหายใจปริมาณมาก และวัดสัญญาณชีพต่าง ๆ ได้ดังนี้ \n อัตราการเต้นของหัวใจ : 94 bpm, ความดันโลหิต : 130/90 mmHg, อัตราการหายใจ : 20 breaths/min และอุณหภูมิร่างกาย : 36.5 องศาเซลเซียส', NULL, 'Q2.2) แพทย์ทำการตรวจ Spirometry เพิ่มเติมเพื่อวัดค่า Forced expiratory volume in 1 second (FEV1) , Forced vital capacity (FVC) และ Residual volume (RV) จงบอกผลการตรวจของผู้ป่วยรายนี้เมื่อเทียบกับคนปกติ\n [เพิ่มขึ้น/ลดลง/ไม่เปลี่ยนแปลง]\n 1) FEV1 (10 คะแนน)\n 2) FEV1/FVC (10 คะแนน)\n 3) RV (10 คะแนน)', NULL, 'final', 30, 90, NULL, NULL, NULL, '1) FEV1 : ลดลง \n 2) FEV1/FVC : ลดลง \n 3) RV : เพิ่มขึ้น', NULL, NULL, NULL),
('FINAL Q2.3', 'FINAL', 'ชายอายุ 67 ปี อาศัยอยู่ที่จังหวัดเชียงใหม่ มาพบแพทย์ด้วยอาการหายใจหอบเหนื่อย ประวัติของผู้ป่วยในระยะเวลา 2 ปีที่ผ่านมา มีอาการไอเรื้อรังแบบมีเสมหะหลายรอบ รอบละประมาณ 3-5 เดือน จากการซักประวัติเพิ่มเติม ผู้ป่วยสูบบุหรี่มาตั้งแต่วัยรุ่น ตรวจร่างกายเบื้องต้นพบภาวะ mild cyanosis ของผิวหนัง ริมฝีปาก และเล็บมีเมือกในทางเดินหายใจปริมาณมาก และวัดสัญญาณชีพต่าง ๆ ได้ดังนี้ \n อัตราการเต้นของหัวใจ : 94 bpm, ความดันโลหิต : 130/90 mmHg, อัตราการหายใจ : 20 breaths/min และอุณหภูมิร่างกาย : 36.5 องศาเซลเซียส', NULL, 'Q2.3) แพทย์ส่งตรวจชิ้นเนื้อทางพยาธิวิทยา พบว่ามีการเพิ่มจำนวนของ cell A ใน bronchi ขนาดเล็กและ bronchiole นอกจากนั้นยังพบการหนาตัวของโครงสร้าง B ใน trachea และ bronchi \n คำถาม\n 1) เซลล์ A คือเซลล์อะไร (10 คะแนน)\n 2) โครงสร้าง B คืออะไร (10 คะแนน) ', 'Q2.3.png', 'final', 20, 90, NULL, NULL, NULL, '1) A = goblet cells  \n 2) B = submucosal glands / mucous glands ', NULL, NULL, NULL),
('FINAL Q2.4', 'FINAL', 'ชายอายุ 67 ปี อาศัยอยู่ที่จังหวัดเชียงใหม่ มาพบแพทย์ด้วยอาการหายใจหอบเหนื่อย ประวัติของผู้ป่วยในระยะเวลา 2 ปีที่ผ่านมา มีอาการไอเรื้อรังแบบมีเสมหะหลายรอบ รอบละประมาณ 3-5 เดือน จากการซักประวัติเพิ่มเติม ผู้ป่วยสูบบุหรี่มาตั้งแต่วัยรุ่น ตรวจร่างกายเบื้องต้นพบภาวะ mild cyanosis ของผิวหนัง ริมฝีปาก และเล็บ มีเมือกในทางเดินหายใจปริมาณมาก และวัดสัญญาณชีพต่าง ๆ ได้ดังนี้ \n อัตราการเต้นของหัวใจ : 94 bpm, ความดันโลหิต : 130/90 mmHg, อัตราการหายใจ : 20 breaths/min และอุณหภูมิร่างกาย : 36.5 องศาเซลเซียส', NULL, 'Q2.4) 3 เดือนต่อมา ผู้ป่วยมีอาการทรุดลง มีไข้และไอมีเสมหะปริมาณมากขึ้นกว่าเดิม แพทย์ส่งตรวจทางห้องปฏิบัติการเพิ่มเติมโดยนำเสมหะไปเพาะเลี้ยงเชื้อ พบเชื้อติดสีแกรมบวกและรูปร่างกลมอยู่กันเป็นคู่ หุ้มด้วย capsule มีคุณสมบัติทำลายเม็ดเลือดแดงแบบ alpha-hemolysis และ sensitive ต่อยา Optochin\n คำถาม\n 1) จงเขียนชื่อเต็มทางวิทยาศาสตร์ของเชื้อก่อโรคดังกล่าวให้ถูกต้อง (15 คะแนน)\n 2) เมื่อทดสอบเชื้อชนิดนี้ด้วย catalase test จะได้ผลเป็นอย่างไร [Positive/Negative] (5 คะแนน)  ', NULL, 'final', 20, 90, NULL, NULL, NULL, '1) Streptococcus pneumoniae \n 2) Negative ', NULL, NULL, NULL),
('FINAL Q2.5', 'FINAL', 'ชายอายุ 67 ปี อาศัยอยู่ที่จังหวัดเชียงใหม่ มาพบแพทย์ด้วยอาการหายใจหอบเหนื่อย ประวัติของผู้ป่วยในระยะเวลา 2 ปีที่ผ่านมา มีอาการไอเรื้อรังแบบมีเสมหะหลายรอบ รอบละประมาณ 3-5 เดือน จากการซักประวัติเพิ่มเติม ผู้ป่วยสูบบุหรี่มาตั้งแต่วัยรุ่น ตรวจร่างกายเบื้องต้นพบภาวะ mild cyanosis ของผิวหนัง ริมฝีปาก และเล็บมีเมือกในทางเดินหายใจปริมาณมาก และวัดสัญญาณชีพต่าง ๆ ได้ดังนี้ \n อัตราการเต้นของหัวใจ : 94 bpm, ความดันโลหิต : 130/90 mmHg, อัตราการหายใจ : 20 breaths/min และอุณหภูมิร่างกาย : 36.5 องศาเซลเซียส', NULL, 'Q2.5) นอกจากยาปฏิชีวนะ แพทย์ให้ยากลุ่ม Beta adrenergic agonist เพื่อขยายหลอดลมและลดการสร้างเมือก ยาดังกล่าวมีผลอย่างไร [กระตุ้น/ยับยั้ง] ต่อระบบประสาทอัตโนมัติใด [sympathetic nervous system /parasympathetic nervous system] (10 คะแนน)', NULL, 'final', 10, 90, NULL, NULL, NULL, 'กระตุ้นระบบประสาท \n sympathetic nervous system', NULL, NULL, NULL),
('Case 3 ปั๊ง!!!', 'FINAL', 'ผู้ป่วยหญิงอายุ 50 ปี ได้รับบาดเจ็บที่ขาจากอุบัติเหตุรถชนต้นไม้อย่างแรง ด้วยความเร็ว 130 กิโลเมตร/ชั่วโมง จากการตรวจร่างกายพบว่าผู้ป่วยมีอาการเจ็บสะโพกซ้ายและขยับขาซ้ายได้ลำบากดังภาพ A และมีอาการชาที่ต้นขาหลังไปถึงท่อนขาล่างซ้าย เมื่อตรวจ X-Ray ได้ผลดังภาพ B ', 'Q3.png', NULL, NULL, 'final', 100, NULL, 'N', NULL, NULL, 'NULL', NULL, NULL, NULL),
('FINAL Q3.1', 'FINAL', 'ผู้ป่วยหญิงอายุ 50 ปี ได้รับบาดเจ็บที่ขาจากอุบัติเหตุรถชนต้นไม้อย่างแรง ด้วยความเร็ว 130 กิโลเมตร/ชั่วโมง จากการตรวจร่างกายพบว่าผู้ป่วยมีอาการเจ็บสะโพกซ้ายและขยับขาซ้ายได้ลำบากดังภาพ A และมีอาการชาที่ต้นขาหลังไปถึงท่อนขาล่างซ้าย เมื่อตรวจ X-Ray ได้ผลดังภาพ B ', 'Q3.png', 'Q3.1) จากภาพจงวินิจฉัยความผิดปกตินี้ (15 คะแนน) \n และความผิดปกติและอาการดังกล่าวเป็นผลจากการกดเส้นประสาทใด (10 คะแนน)', NULL, 'final', 25, 90, NULL, NULL, NULL, '- Posterior hip dislocation / Posterior dislocation of hip (joint) / Dashboard dislocation\n - Sciatic nerve ', NULL, NULL, NULL),
('FINAL Q3.2', 'FINAL', 'ผู้ป่วยหญิงอายุ 50 ปี ได้รับบาดเจ็บที่ขาจากอุบัติเหตุรถชนต้นไม้อย่างแรง ด้วยความเร็ว 130 กิโลเมตร/ชั่วโมง จากการตรวจร่างกายพบว่าผู้ป่วยมีอาการเจ็บสะโพกซ้ายและขยับขาซ้ายได้ลำบากดังภาพ A และมีอาการชาที่ต้นขาหลังไปถึงท่อนขาล่างซ้าย เมื่อตรวจ X-Ray ได้ผลดังภาพ B ', 'Q3.png', 'Q3.2) จากภาพจงบอกชนิดของ Synovial Joint ที่เกิดความผิดปกติ (5 คะแนน) \n และบอกชื่อ Ligament ที่เป็นองค์ประกอบของ Joint capsule ของ Synovial Joint ดังกล่าวมา 2 ชื่อ (ชื่อละ 10 คะแนน)', NULL, 'final', 25, 90, NULL, NULL, NULL, '- Ball and socket joint \n - Iliofemoral lig. / Pubofemoral lig. / Ischiofemoral lig. ', NULL, NULL, NULL),
('FINAL Q3.3', 'FINAL', 'ผู้ป่วยหญิงอายุ 50 ปี ได้รับบาดเจ็บที่ขาจากอุบัติเหตุรถชนต้นไม้อย่างแรง ด้วยความเร็ว 130 กิโลเมตร/ชั่วโมง จากการตรวจร่างกายพบว่าผู้ป่วยมีอาการเจ็บสะโพกซ้ายและขยับขาซ้ายได้ลำบากดังภาพ A และมีอาการชาที่ต้นขาหลังไปถึงท่อนขาล่างซ้าย เมื่อตรวจ X-Ray ได้ผลดังภาพ B ', 'Q3.png', 'Q3.3) เมื่อตรวจร่างกายเพิ่มเติม พบผู้ป่วยมีอาการเจ็บที่สะโพกขวา ผลตรวจ X-Ray ดังภาพ\n จากความผิดปกติในภาพ มักพบการฉีกขาดของหลอดเลือดแดงใดได้มากที่สุด (15 คะแนน) \n และจากการฉีกขาดของหลอดเลือดดังกล่าวผู้ป่วยมีโอกาสเกิดภาวะแทรกซ้อนใดตามมาได้มากที่สุด (15 คะแนน)', 'Q3.3.png', 'final', 30, 90, NULL, NULL, NULL, '- Medial circumflex femoral artery \n - Aseptic necrosis / Aseptic avascular necrosis / Osteonecrosis / Avascular necrosis ', NULL, NULL, NULL),
('FINAL Q3.4', 'FINAL', 'ผู้ป่วยหญิงอายุ 50 ปี ได้รับบาดเจ็บที่ขาจากอุบัติเหตุรถชนต้นไม้อย่างแรง ด้วยความเร็ว 130 กิโลเมตร/ชั่วโมง จากการตรวจร่างกายพบว่าผู้ป่วยมีอาการเจ็บสะโพกซ้ายและขยับขาซ้ายได้ลำบากดังภาพ A และมีอาการชาที่ต้นขาหลังไปถึงท่อนขาล่างซ้าย เมื่อตรวจ X-Ray ได้ผลดังภาพ B ', 'Q3.png', 'Q3.4) ในกระบวนการซ่อมแซมเนื้อเยื่อกระดูกของผู้ป่วยจะพบเซลล์ดังภาพ จงระบุชื่อเซลล์ที่ลูกศรชี้แสดง (5 คะแนน)\n และจงบอกชื่อสารอินทรีย์ที่หลั่งออกจากเซลล์ชนิดนี้ (5 คะแนน)', 'Q3.4.png', 'final', 10, 90, NULL, NULL, NULL, '- Osteoblast\n - Collagen / Ground substance (proteoglycan) ', NULL, NULL, NULL),
('FINAL Q3.5', 'FINAL', 'ผู้ป่วยหญิงอายุ 50 ปี ได้รับบาดเจ็บที่ขาจากอุบัติเหตุรถชนต้นไม้อย่างแรง ด้วยความเร็ว 130 กิโลเมตร/ชั่วโมง จากการตรวจร่างกายพบว่าผู้ป่วยมีอาการเจ็บสะโพกซ้ายและขยับขาซ้ายได้ลำบากดังภาพ A และมีอาการชาที่ต้นขาหลังไปถึงท่อนขาล่างซ้าย เมื่อตรวจ X-Ray ได้ผลดังภาพ B ', 'Q3.png', 'Q3.5) ในกระบวนการ Bone repair หลังจากการตกตะกอนของแคลเซียม (Mineralization) จะได้สารชื่อว่าอะไร (10 คะแนน)', NULL, 'final', 10, 90, NULL, NULL, NULL, 'Hydroxyapatite / Ca5(PO4)3OH ', NULL, NULL, NULL),
('Case 4 ลำธารมรณะ', 'FINAL', 'ชายวัย 40 ปี มาพบแพทย์ด้วยอาการไข้ขึ้นสูง ไอ หนาวสั่น และปวดเมื่อยกล้ามเนื้อ จากการตรวจ physical examination เบื้องต้น พบว่ามีอาการตับม้ามโต (Splenohepatomegaly) จากการซักประวัติ เมื่อ 10 สัปดาห์ก่อน เขาพบผื่นและตุ่มสีแดงจำนวนมากที่บริเวณขา หลังจากที่ถอดรองเท้าและลงไปแช่น้ำในลำธารขณะเดินป่าที่ประเทศ Madagascar แพทย์สงสัยการติดเชื้อพยาธิชนิดหนึ่ง จึงได้สั่งตรวจอุจจาระ ได้ผลตามภาพ A', 'Q4.png', NULL, NULL, 'final', 100, NULL, 'N', NULL, NULL, 'NULL', NULL, NULL, NULL),
('FINAL Q4.1', 'FINAL', 'ชายวัย 40 ปี มาพบแพทย์ด้วยอาการไข้ขึ้นสูง ไอ หนาวสั่น และปวดเมื่อยกล้ามเนื้อ จากการตรวจ physical examination เบื้องต้น พบว่ามีอาการตับม้ามโต (Splenohepatomegaly) จากการซักประวัติ เมื่อ 10 สัปดาห์ก่อน เขาพบผื่นและตุ่มสีแดงจำนวนมากที่บริเวณขา หลังจากที่ถอดรองเท้าและลงไปแช่น้ำในลำธารขณะเดินป่าที่ประเทศ Madagascar แพทย์สงสัยการติดเชื้อพยาธิชนิดหนึ่ง จึงได้สั่งตรวจอุจจาระ ได้ผลตามภาพ A', 'Q4.png', 'Q4.1) จงเขียนชื่อเต็มทางวิทยาศาสตร์ของเชื้อก่อโรคที่มีความเป็นไปได้มากที่สุดในคนไข้รายนี้ (20 คะแนน)', NULL, 'final', 20, 90, NULL, NULL, NULL, 'Schistosoma mansoni', NULL, NULL, NULL),
('FINAL Q4.2', 'FINAL', 'ชายวัย 40 ปี มาพบแพทย์ด้วยอาการไข้ขึ้นสูง ไอ หนาวสั่น และปวดเมื่อยกล้ามเนื้อ จากการตรวจ physical examination เบื้องต้น พบว่ามีอาการตับม้ามโต (Splenohepatomegaly) จากการซักประวัติ เมื่อ 10 สัปดาห์ก่อน เขาพบผื่นและตุ่มสีแดงจำนวนมากที่บริเวณขา หลังจากที่ถอดรองเท้าและลงไปแช่น้ำในลำธารขณะเดินป่าที่ประเทศ Madagascar แพทย์สงสัยการติดเชื้อพยาธิชนิดหนึ่ง จึงได้สั่งตรวจอุจจาระ ได้ผลตามภาพ A', 'Q4.png', 'Q4.2) จงบอกระยะติดต่อ (infective stage) ของเชื้อก่อโรคชนิดนี้ (10 คะแนน)  ', NULL, 'final', 10, 90, NULL, NULL, NULL, 'Cercaria', NULL, NULL, NULL),
('FINAL Q4.3', 'FINAL', 'ชายวัย 40 ปี มาพบแพทย์ด้วยอาการไข้ขึ้นสูง ไอ หนาวสั่น และปวดเมื่อยกล้ามเนื้อ จากการตรวจ physical examination เบื้องต้น พบว่ามีอาการตับม้ามโต (Splenohepatomegaly) จากการซักประวัติ เมื่อ 10 สัปดาห์ก่อน เขาพบผื่นและตุ่มสีแดงจำนวนมากที่บริเวณขา หลังจากที่ถอดรองเท้าและลงไปแช่น้ำในลำธารขณะเดินป่าที่ประเทศ Madagascar แพทย์สงสัยการติดเชื้อพยาธิชนิดหนึ่ง จึงได้สั่งตรวจอุจจาระ ได้ผลตามภาพ A', 'Q4.png', 'Q4.3) ตารางด้านล่างแสดงสิ่งมีชีวิตที่เป็น host แต่ละประเภทของเชื้อก่อโรคในคนไข้รายนี้ จงระบุคำในช่อง A (10 คะแนน) และช่อง B (10 คะแนน)', 'Q4.3.png', 'final', 20, 90, NULL, NULL, NULL, 'A = Definitive host \n B = Freshwater snails ', NULL, NULL, NULL),
('FINAL Q4.4', 'FINAL', 'ชายวัย 40 ปี มาพบแพทย์ด้วยอาการไข้ขึ้นสูง ไอ หนาวสั่น และปวดเมื่อยกล้ามเนื้อ จากการตรวจ physical examination เบื้องต้น พบว่ามีอาการตับม้ามโต (Splenohepatomegaly) จากการซักประวัติ เมื่อ 10 สัปดาห์ก่อน เขาพบผื่นและตุ่มสีแดงจำนวนมากที่บริเวณขา หลังจากที่ถอดรองเท้าและลงไปแช่น้ำในลำธารขณะเดินป่าที่ประเทศ Madagascar แพทย์สงสัยการติดเชื้อพยาธิชนิดหนึ่ง จึงได้สั่งตรวจอุจจาระ ได้ผลตามภาพ A', 'Q4.png', 'Q4.4) หลังจากที่ได้รับยาจากแพทย์แล้ว คนไข้กินยาไม่ครบตามที่กำหนด ส่งผลให้ 6 เดือนต่อมา คนไข้ได้กลับมาที่โรงพยาบาลด้วยอาการเหนื่อยล้าง่าย คลื่นไส้ อาเจียน และขาบวมแบบกดแล้วบุ๋มค้าง (Pitting edema) แพทย์ได้ทำ liver sonography และได้ผลตามภาพ B \n จงระบุว่า ค่าดังต่อไปนี้จากผลตรวจเลือดของคนไข้ จะมีการเปลี่ยนแปลงไปจากค่าปกติอย่างไร \n [เพิ่มขึ้น/ลดลง/ไม่เปลี่ยนแปลง] \n 1) Ammonia (10 คะแนน)\n 2) Aspartate aminotransferase (5 คะแนน)\n 3) Serum albumin (5 คะแนน)', 'Q4.4.png', 'final', 20, 90, NULL, NULL, NULL, '1) Ammonia : เพิ่มขึ้น \n 2) Aspartate aminotransferase : เพิ่มขึ้น \n 3) Serum albumin : ลดลง', NULL, NULL, NULL),
('FINAL Q4.5', 'FINAL', 'ชายวัย 40 ปี มาพบแพทย์ด้วยอาการไข้ขึ้นสูง ไอ หนาวสั่น และปวดเมื่อยกล้ามเนื้อ จากการตรวจ physical examination เบื้องต้น พบว่ามีอาการตับม้ามโต (Splenohepatomegaly) จากการซักประวัติ เมื่อ 10 สัปดาห์ก่อน เขาพบผื่นและตุ่มสีแดงจำนวนมากที่บริเวณขา หลังจากที่ถอดรองเท้าและลงไปแช่น้ำในลำธารขณะเดินป่าที่ประเทศ Madagascar แพทย์สงสัยการติดเชื้อพยาธิชนิดหนึ่ง จึงได้สั่งตรวจอุจจาระ ได้ผลตามภาพ A', 'Q4.png', 'Q4.5) หลังจากรักษาตามอาการ แพทย์ได้กำชับให้ผู้ป่วยกินยาให้ครบตามกำหนดเพื่อป้องกันภาวะแทรกซ้อนที่แสดงดังภาพ C\n คำถาม\n 1) ความผิดปกติดังภาพมีชื่อเรียกว่าอะไร (15 คะแนน)\n 2) ความผิดปกติดังภาพมีสาเหตุมาจากการเพิ่มขึ้นของความดันในเส้นเลือดใด (15 คะแนน)', 'Q4.5.png', 'final', 30, 90, NULL, NULL, NULL, '1) Caput medusae  \n 2) Hepatic portal vein ', NULL, NULL, NULL),
('Case5 ใจสั่นเพราะกาแฟหรือแกฟะ', 'FINAL', 'เด็กชายอายุ 11 ปี มีอาการเจ็บคอ แต่ไม่มีอาการไอ แพทย์ตรวจร่างกายพบว่ามีไข้ 38.3 องศาเซลเซียส และต่อม tonsil เป็นหนอง แพทย์ให้ยาปฏิชีวนะและให้กลับบ้านได้\n \n หลังจากนั้น 3 สัปดาห์ต่อมา แพทย์ตรวจร่างกายพบว่าไม่มีไข้, heart rate 85/min, respiratory rate 18/min, blood pressure 90/50 mmHg ฟังเสียงหัวใจได้ยิน murmur ที่บริเวณ apex และมีเสียง diffuse rales ทั่วปอดทั้ง 2 ข้าง แพทย์จึงให้ผู้ป่วยนอนรักษาตัวที่โรงพยาบาล', NULL, NULL, NULL, 'final', 100, NULL, 'N', NULL, NULL, 'NULL', NULL, NULL, NULL),
('FINAL Q5.1', 'FINAL', 'เด็กชายอายุ 11 ปี มีอาการเจ็บคอ แต่ไม่มีอาการไอ แพทย์ตรวจร่างกายพบว่ามีไข้ 38.3 องศาเซลเซียส และต่อม tonsil เป็นหนอง แพทย์ให้ยาปฏิชีวนะและให้กลับบ้านได้\n \nหลังจากนั้น 3 สัปดาห์ต่อมา แพทย์ตรวจร่างกายพบว่าไม่มีไข้, heart rate 85/min, respiratory rate 18/min, blood pressure 90/50 mmHg ฟังเสียงหัวใจได้ยิน murmur ที่บริเวณ apex และมีเสียง diffuse rales ทั่วปอดทั้ง 2 ข้าง แพทย์จึงให้ผู้ป่วยนอนรักษาตัวที่โรงพยาบาล', NULL, 'Q5.1) แพทย์ส่งตรวจ throat culture พบเชื้อ Streptococcus pyogenes เชื้อก่อโรคนี้มี Virulence factor ใดที่สำคัญที่สุด ที่ทำให้เกิดอาการทางหัวใจและหลอดเลือดของผู้ป่วยนี้  (15 คะแนน)', NULL, 'final', 15, 90, NULL, NULL, NULL, 'M-protein / Matrix protein ', NULL, NULL, NULL),
('FINAL Q5.2', 'FINAL', 'เด็กชายอายุ 11 ปี มีอาการเจ็บคอ แต่ไม่มีอาการไอ แพทย์ตรวจร่างกายพบว่ามีไข้ 38.3 องศาเซลเซียส และต่อม tonsil เป็นหนอง แพทย์ให้ยาปฏิชีวนะและให้กลับบ้านได้\n \nหลังจากนั้น 3 สัปดาห์ต่อมา แพทย์ตรวจร่างกายพบว่าไม่มีไข้, heart rate 85/min, respiratory rate 18/min, blood pressure 90/50 mmHg ฟังเสียงหัวใจได้ยิน murmur ที่บริเวณ apex และมีเสียง diffuse rales ทั่วปอดทั้ง 2 ข้าง แพทย์จึงให้ผู้ป่วยนอนรักษาตัวที่โรงพยาบาล', NULL, 'Q5.2) เชื้อก่อโรคนี้มักทำให้เกิดพยาธิสภาพที่ลิ้นหัวใจใด (10 คะแนน) ', NULL, 'final', 10, 90, NULL, NULL, NULL, 'Mitral valve / Bicuspid valve / Left AV valve ', NULL, NULL, NULL),
('FINAL Q5.3', 'FINAL', 'เด็กชายอายุ 11 ปี มีอาการเจ็บคอ แต่ไม่มีอาการไอ แพทย์ตรวจร่างกายพบว่ามีไข้ 38.3 องศาเซลเซียส และต่อม tonsil เป็นหนอง แพทย์ให้ยาปฏิชีวนะและให้กลับบ้านได้\n \nหลังจากนั้น 3 สัปดาห์ต่อมา แพทย์ตรวจร่างกายพบว่าไม่มีไข้, heart rate 85/min, respiratory rate 18/min, blood pressure 90/50 mmHg ฟังเสียงหัวใจได้ยิน murmur ที่บริเวณ apex และมีเสียง diffuse rales ทั่วปอดทั้ง 2 ข้าง แพทย์จึงให้ผู้ป่วยนอนรักษาตัวที่โรงพยาบาล', NULL, 'Q5.3) 2 วันต่อมาผู้ป่วยรู้สึกใจสั่น แน่นหนาอก เหนื่อยหอบ และมีแนวโน้มเป็น Left ventricular failure แพทย์จึงส่งตรวจ EKG พบผลดังภาพ จงแปลผลภาวะดังกล่าว (20 คะแนน)', 'Q5.3.png', 'final', 20, 90, NULL, NULL, NULL, 'Atrial fibrillation', NULL, NULL, NULL),
('FINAL Q5.4', 'FINAL', 'เด็กชายอายุ 11 ปี มีอาการเจ็บคอ แต่ไม่มีอาการไอ แพทย์ตรวจร่างกายพบว่ามีไข้ 38.3 องศาเซลเซียส และต่อม tonsil เป็นหนอง แพทย์ให้ยาปฏิชีวนะและให้กลับบ้านได้\n \nหลังจากนั้น 3 สัปดาห์ต่อมา แพทย์ตรวจร่างกายพบว่าไม่มีไข้, heart rate 85/min, respiratory rate 18/min, blood pressure 90/50 mmHg ฟังเสียงหัวใจได้ยิน murmur ที่บริเวณ apex และมีเสียง diffuse rales ทั่วปอดทั้ง 2 ข้าง แพทย์จึงให้ผู้ป่วยนอนรักษาตัวที่โรงพยาบาล', NULL, 'Q5.4) พยาธิสภาพใดหรือความผิดปกติใดที่ส่งผลให้เกิด left ventricular failure ได้มากที่สุดในผู้ป่วยรายนี้ (30 คะแนน)', NULL, 'final', 30, 90, NULL, NULL, NULL, 'Myocarditis ', NULL, NULL, NULL),
('FINAL Q5.5', 'FINAL', 'เด็กชายอายุ 11 ปี มีอาการเจ็บคอ แต่ไม่มีอาการไอ แพทย์ตรวจร่างกายพบว่ามีไข้ 38.3 องศาเซลเซียส และต่อม tonsil เป็นหนอง แพทย์ให้ยาปฏิชีวนะและให้กลับบ้านได้\n \nหลังจากนั้น 3 สัปดาห์ต่อมา แพทย์ตรวจร่างกายพบว่าไม่มีไข้, heart rate 85/min, respiratory rate 18/min, blood pressure 90/50 mmHg ฟังเสียงหัวใจได้ยิน murmur ที่บริเวณ apex และมีเสียง diffuse rales ทั่วปอดทั้ง 2 ข้าง แพทย์จึงให้ผู้ป่วยนอนรักษาตัวที่โรงพยาบาล', NULL, 'Q5.5) 1 ปีต่อมา แพทย์ตรวจได้ยินเสียง murmur ลักษณะใดที่บริเวณ apex ของหัวใจ (25 คะแนน)', NULL, 'final', 25, 90, NULL, NULL, NULL, 'Diastolic rumbling murmur / Diastolic murmur ', NULL, NULL, NULL),
('TB01', 'TB', NULL, NULL, 'หากผู้ป่วยถูกสุนัขกัดจนมีแผลฉีกขาดและมีเลือดออก เมื่อไปถึงโรงพยาบาล แพทย์จะฉีดอะไร \n ให้กับผู้ป่วยบ้าง จงระบุให้จำเพาะ', NULL, NULL, 1, 45, 'N', NULL, NULL, 'Rabies vaccine + RIG (Rabies Immunoglobulin)', NULL, NULL, NULL),
('TB02', 'TB', NULL, NULL, 'ผู้ป่วยได้รับอันตรายจากสัตว์มีพิษไม่ทราบชนิด แพทย์ตรวจร่ายกายพบแผลพุพองดังภาพ หลังจากนั้น \n ผู้ป่วยรู้สึกคลื่นไส้ อาเจียนและมีไข้ร่วมด้วย จงระบุชื่อของสัตว์มีพิษชนิดนี้', 'TB02.jpg', NULL, 1, 45, 'N', NULL, NULL, 'แมลงก้นกระดก', NULL, NULL, NULL),
('TB03', 'TB', NULL, NULL, 'หญิงตั้งครรภ์ได้รับการตรวจภาวะเบาหวานระหว่างตั้งครรภ์ โดยการดื่มสารละลายกลูโคส 75 กรัม หลังจากอดอาหารมาแล้ว 8 ชั่วโมง และตรวจดูระดับน้ำตาลที่ลดลงเมื่อเวลาผ่านไป 2 ชั่วโมง การตรวจชนิดนี้ชื่อว่าอะไร (Full name)', NULL, NULL, 1, 45, 'N', NULL, NULL, 'Oral glucose tolerance test', NULL, NULL, NULL),
('TB04', 'TB', NULL, NULL, 'จงระบุ genus ของเชื้อ normal flora ที่พบมากที่สุดใน urogenital tract ของคนที่มีสุขภาพดี', NULL, NULL, 1, 45, 'N', NULL, NULL, 'Lactobacillus', NULL, NULL, NULL),
('TB05', 'TB', NULL, NULL, 'การรับประทานกล้วยจำนวน 555 ลูก จะเทียบเท่ากับผลกระทบทางรังสีต่อสุขภาพของสิ่งใดต่อไปนี้ (Dental X-ray/ Chest CT scan/Chest X-ray)', NULL, NULL, 1, 45, 'N', NULL, NULL, 'Chest X-ray', NULL, NULL, NULL),
('Test01', 'TEST', NULL, NULL, 'สีประจำคณะแพทย์มหาวิทยาลัยเชียงใหม่คือ', 'TEST01A.svg', NULL, 0, 120, 'N', NULL, NULL, 'สีเขียวหัวเป็ดแมนดาริน', NULL, NULL, NULL),
('Test02', 'TEST', NULL, NULL, 'จงเขียนชื่อเต็มของกรุงเทพมหานคร', 'IMG_9274.JPG', NULL, 0, 120, 'N', NULL, NULL, 'กรุงเทพมหานคร อมรรัตนโกสินทร์ มหินทรายุธยา มหาดิลกภพ นพรัตน์ราชธานีบุรีรมย์ อุดมราชนิเวศน์มหาสถาน อมรพิมานอวตารสถิต สักกะทัตติยะวิษณุกรรมประสิทธิ์', NULL, NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `system_variables`
--

CREATE TABLE `system_variables` (
  `id` varchar(50) DEFAULT NULL,
  `value` varchar(100) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `system_variables`
--

INSERT INTO `system_variables` (`id`, `value`) VALUES
('LOOP', NULL),
('CURRENT_QUESTION', 'FINAL Q1.1'),
('CURRENT_TEAM', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `user_id` varchar(50) DEFAULT NULL,
  `username` varchar(50) DEFAULT NULL,
  `password` varchar(50) DEFAULT NULL,
  `role` varchar(50) DEFAULT NULL,
  `owner_name` varchar(50) DEFAULT NULL,
  `subrole` varchar(50) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci ROW_FORMAT=DYNAMIC;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`user_id`, `username`, `password`, `role`, `owner_name`, `subrole`) VALUES
('semi01', 'semi01', 'semi01', 'participant', 'NUD_02', 'final'),
('semi02', 'semi02', 'semi02', 'participant', 'สกร_01', 'final'),
('semi03', 'semi03', 'semi03', 'participant', 'SWK_01', 'final'),
('semi04', 'semi04', 'semi04', 'participant', 'DARA_01', 'final'),
('semi05', 'semi05', 'semi05', 'participant', 'Huhu', 'final'),
('semi06', 'semi06', 'semi06', 'participant', 'บูรพาไร้พ่าย', 'final'),
('semi07', 'semi07', 'semi07', 'participant', 'SWK_03', 'final'),
('semi08', 'semi08', 'semi08', 'participant', 'Bunyawat_01', 'final'),
('อาจารย์', 'prof01', 'prof01', 'teacher', 'prof01', NULL),
('ถ่ายทอดสด', 'streamer01', 'streamer01', 'streamer', 'streamer01', NULL),
('admin', 'admin', 'admin', 'admin', 'admin', NULL),
('final01', 'final1', 'final1', 'participant', 'MC_01', 'final'),
('final02', 'final2', 'final2', 'participant', 'สาธิตมหาวิทยาลัยเชียงใหม่_02', 'final'),
('final03', 'final3', 'final3', 'participant', 'PRC_01', 'final'),
('final04', 'final4', 'final4', 'participant', 'Bunyawat_01', 'final'),
('final05', 'final5', 'final5', 'participant', 'สกร_01', 'final'),
('final06', 'final6', 'final6', 'participant', 'SWK_01', 'final'),
('semi09', 'semi09', 'semi09', 'participant', 'MC_02', 'final'),
('semi10', 'semi10', 'semi10', 'participant', 'บุรีรัมย์พิทยาคม_01', 'final');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `flower_states`
--
ALTER TABLE `flower_states`
  ADD PRIMARY KEY (`team_id`);

--
-- Indexes for table `flower_state_history`
--
ALTER TABLE `flower_state_history`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `item_usage`
--
ALTER TABLE `item_usage`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `flower_state_history`
--
ALTER TABLE `flower_state_history`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT for table `item_usage`
--
ALTER TABLE `item_usage`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
